---
kind: property
id: P:Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.RestrictionType
source: html/baf12ef1-5ba8-6a7b-da71-04d1676d8dd6.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.RestrictionType Property

A type of input point restriction.

## Syntax (C#)
```csharp
public string RestrictionType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null